# Программа определяет расстояние между двумя автомобилями через T часов.
# Автомобили удаляются друг от друга поэтому их скорости складываются.

try:
    V1 = int(input("Введите скорость первого автомобиля:"))
    V2 = int(input("Введите скорость второго автомобиля:"))
    S = int(input("Введите начальное расстояние:"))
    T = int(input("Введите время:"))

    DS = S + (V1 + V2) * T
    print("Расстояние между автомобилями:",DS, "км")

except ValueError:
    # Если пользователь ввёл не число
    print("Ошибка: необходимо вводить числа.")